["Sesame seeds occur in many colours depending on the cultivar. The most traded variety of sesame is off-white coloured. Other common colours are buff, tan, gold, brown, reddish, gray, and black. The colour is the same for the hull and the fruit.", "Sesame fruit is a capsule, normally pubescent, rectangular in section, and typically grooved with a short, triangular beak. The length of the fruit capsule varies from 2 to 8 centimetres (3⁄4 to 3+1⁄8 in), its width varies between 0.5 and 2.0 centimetres (13⁄64 and 25⁄32 in), and the number of loculi varies from four to 12. The fruit naturally splits open (dehisces) to release the seeds by splitting along the septa from top to bottom or by means of two apical pores, depending on the varietal cultivar. The degree of dehiscence is of importance in breeding for mechanised harvesting, as is the insertion height of the first capsule.", "Sesame seeds are small. Their sizes vary with the thousands of varieties known. Typically, the seeds are about 3 to 4 mm long by 2 mm wide and 1 mm thick (15⁄128 to 5⁄32 × 5⁄64 × 5⁄128). The seeds are ovate, slightly flattened, and somewhat thinner at the eye of the seed (hilum) than at the opposite end. The mass of 100 seeds is 0.203 g.[30] The seed coat (testa) may be smooth or ribbed.", "After harvesting, the seeds are usually cleaned and hulled. In some countries, once the seeds have been hulled, they are passed through an electronic color-sorting machine that rejects any discolored seeds to ensure perfect color, because sesame seeds with consistent appearance are perceived to be of better quality by consumers, and sell for a higher price.", "Immature or off-sized seeds are removed and used for sesame oil production.", "Japan is the world's largest sesame importer. Sesame oil, particularly from roasted seed, is an important component of Japanese cooking and traditionally the principal use of the seed. China is the second-largest importer of sesame, mostly oil-grade. China exports lower-priced food-grade sesame seeds, particularly to Southeast Asia. Other major importers are United States, Canada, Netherlands, Turkey, and France.", "In myths, the opening of the capsule releases the treasure of sesame seeds,[69] as applied in the story of \"Ali Baba and the Forty Thieves\" when the phrase \"Open Sesame\" magically opens a sealed cave. Upon ripening, sesame pods split, releasing a pop and possibly indicating the origin of this phrase.", "Sesame seeds are used conceptually in Hindi literature, in the proverbs \"til dharne ki jagah na hona\", meaning a place so crowded that no room remains for a single seed of sesame, and \"in tilon men tel nahin\", referring to a person who appears to be useful, but is selfish when the time for need comes, literally meaning \"no oil (is left) in this sesame.\""]